TexasInstruments/motor-control-sdk/examples/position_sense/nikon_diagnostic/single_channel/am263px-lp/r5fss0-0_freertos/example.syscfg
nikon1.$name                             = "CONFIG_NIKON0";
nikon1.channel_1                         = true;
nikon1.channel_0                         = false;
nikon1.Booster_Pack                      = true;
nikon1.PRU_Slice                         = "PRU0";
nikon1["PRU-ICSS"].PR0_PRU0_GPIO5.$used  = true;
nikon1["PRU-ICSS"].PR0_PRU0_GPIO4.$used  = true;
nikon1["PRU-ICSS"].PR0_PRU0_GPIO3.$used  = true;
nikon1["PRU-ICSS"].PR0_PRU0_GPIO10.$used = true;
nikon1.ENC0_EN.$name                     = "ENC1_EN";
nikon1.ENC0_EN.GPIO_n.$assign            = "SDFM0_D1";

pruicss1.$name                           = "CONFIG_PRU_ICSS0";
nikon1.pru                               = pruicss1;
pruicss1.AdditionalICSSSettings[0].$name = "CONFIG_PRU_ICSS_IO0";
pruicss1.intcMapping.create(1);
pruicss1.intcMapping[0].$name            = "CONFIG_ICSS0_INTC_MODE1_MAPPING0";
pruicss1.intcMapping[0].event            = "18";

epwm_syncout_xbar1.$name      = "CONFIG_EPWM_SYNCOUT_XBAR0";
epwm_syncout_xbar1.xbarOutput = ["EPWM0_SYNCOUT"];

soc_timesync_xbar11.$name      = "CONFIG_SOC_TIMESYNC_XBAR1_0";
soc_timesync_xbar11.xbarOutput = "SOC_TIMESYNC_XBAR1_PWM_SYNCOUT_XBAR_OUT_0";
soc_timesync_xbar11.instance   = "SOC_TIMESYNC_XBAR1_ICSS_MODULE_0";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.EPWM.A.$suggestSolution                       = "EPWM0_A";
epwm1.EPWM.B.$suggestSolution                       = "EPWM0_B";
i2c1.I2C.SCL.$suggestSolution                       = "I2C1_SCL";
i2c1.I2C.SDA.$suggestSolution                       = "I2C1_SDA";
nikon1["PRU-ICSS"].$suggestSolution                 = "PRU-ICSS";
nikon1["PRU-ICSS"].PR0_PRU0_GPIO5.$suggestSolution  = "PR0_PRU0_GPIO5";
nikon1["PRU-ICSS"].PR0_PRU0_GPIO4.$suggestSolution  = "PR0_PRU0_GPIO4";
nikon1["PRU-ICSS"].PR0_PRU0_GPIO3.$suggestSolution  = "PR0_PRU0_GPIO3";
nikon1["PRU-ICSS"].PR0_PRU0_GPIO10.$suggestSolution = "PR0_PRU0_GPIO10";
